[
    {
        "text_input": "Being is said in many ways.",
        "output": "The main source of the difficulties met with seems to lie in the following: it has not always been kept in mind that the semantical concepts have a relative character, that they must always be related to a particular language. People have not been aware that the language about which we speak need by no means coincide with the language in which we speak. They have carried out the semantics of a language in that language itself and, generally speaking, they have proceeded as though there was only one language in the world. The analysis of the antimonies mentioned shows, on the contrary, that the semantical concepts simply have no place in the language to which they relate, that the language which contains its own semantics, and within which the usual logical laws hold, must inevitably be inconsistent."
    },
    {
        "text_input": "Critique pure judgement.",
        "output": "The universe consists of objects having various qualities and standing in various relations. SOme of the objects which occur in the universe are complex. When an object is complex, it consists of interrelated parts. Let us consider a complex object composed of two parts *a* and *b* standing to each other in the relation *R*. The complex object *a-in-the-relation-R-to-b* may be capable of being *perceived*; when perceived, it is perceived as one object. Attention may show that it is complex; we then *judge* that *a* and *b* stand in the relation *R*. SUch a judgement, being derived from perception by mere attention, may be called a 'judgement of perception'. This judgement of perception, considered as an actual occurence, is a relation of four terms, namely *a* and *b* and *R* and the percipient. The percetion, on the contrary, is a relation of two terms, namely 'a-in-the-relation-R-to-b' and the percipient. Since an object of perception cannot be nothing, we cannot perceive *a-in-the-relation-R-to-b* unless *a* is in the relation *R* to *b*. Hence a judgement of perception, according to the above definition, must be true. This does not mean that, in a judgement which *appears* to us to be one of perception, we are sure of not being in error, since we may err in thinking that our judgement has really been derived merely by analysis of what was perceived. But if our judgement has been so derived, it must be true. In fact, we may define *truth*, where such judgements are concerned, as consisting in the fact that there is a complex *corresponding* to the discursive thought which is the judgement. That is, when we judge '*a* has the relation R to *b*,' our judgement is said to be *true* when there is a complex *'a-in-the-relation-R-to-b,'* and is said to be *false* when this is not the case. This is a definition of truth and falsehood in relation to judgements of this kind."
    },
    {
        "text_input": "What does it mean 'to be true'?",
        "output": "Of things that reciprocate as to implication of being, that which is in some way the cause of the other's being might perfectly sensibly be called prior in nature. And that there are some such cases is clear. For there being a human reciprocates as to implication of being with the true statement about it: if there is a human, the statement whereby we say that there is a human is true, and reciprocally--since if the statement whereby we say there is a human is true, there is a human. And whereas the true statement is in no way the cause of the thing's being, the thing does seem in some way to be the cause of the statement's being true. For it is because of the thing's being or not being that the statement is called true or false."
    }
]